Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem Properties
The UserPropertyItem type exposes the following members.
Properties
Name | Description
AffectsNumbering
 Indicates whether the property value affects the numbering of objects.
FieldType
 The field type of the user property.
Level
 The level at which the user property has been defined.
Name
 The name of the user property.
Type
 The type of the user property.
Unique
 Indicates whether the property value is copied when the object is copied.
Visibility
 Indicates whether the property value is visible/editable.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace